const {Router} = require('express')
const router = Router()


//отримання списку задач
router.get('/',(req,res)=>{

})

//створення нової задачі
router.post('/',(req,res)=>{
    
})

//змінення задачі коли натискаєм на чекбокс
//потрібно зрозуміти яке туду буде оброблятись,тому до шляху додаєьбся динамічний Айді
router.put('/:id',(req,res)=>{
    
})

//потрібно зрозуміти яке туду ми буде видалятись,тому до шляху додаєьбся динамічний Айді
router.delete('/:id',(req,res)=>{
    
})

module.exports = router